#include"DrawHeart.h"
extern void draw(int a)
{
	int i = 0;
	char*love1[17];
	love1[0] = "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à\n";
	love1[1] = "¡à¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à\n";
	love1[2] = "¡à¡à¡à¡á¡á¡á¡á¡á¡à¡à¡à¡á¡á¡á¡á¡á¡à¡à¡à\n";
	love1[3] = "¡à¡à¡á¡á¡á¡á¡á¡á¡á¡à¡á¡á¡á¡á¡á¡á¡á¡à¡à\n";
	love1[4] = "¡à¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡à\n";
	love1[5] = "¡à¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡à\n";
	love1[6] = "¡à¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡à\n";
	love1[7] = "¡à¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡à\n";
	love1[8] = "¡à¡à¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡à¡à\n";
	love1[9] = "¡à¡à¡à¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡à¡à¡à\n";
	love1[10] = "¡à¡à¡à¡à¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡à¡à¡à¡à\n";
	love1[11] = "¡à¡à¡à¡à¡à¡á¡á¡á¡á¡á¡á¡á¡á¡á¡à¡à¡à¡à¡à\n";
	love1[12] = "¡à¡à¡à¡à¡à¡à¡á¡á¡á¡á¡á¡á¡á¡à¡à¡à¡à¡à¡à\n";
	love1[13] = "¡à¡à¡à¡à¡à¡à¡à¡á¡á¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à\n";
	love1[14] = "¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à\n";
	love1[15] = "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à\n";
	love1[16] = "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à\n";

	char*love2[17];
	love2[0] = "¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n";
	love2[1] = "¡á¡á¡á¡á¡à¡à¡à¡á¡á¡á¡á¡á¡à¡à¡à¡á¡á¡á¡á\n";
	love2[2] = "¡á¡á¡á¡à¡à¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡á¡á¡á\n";
	love2[3] = "¡á¡á¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡á¡á\n";
	love2[4] = "¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á\n";
	love2[5] = "¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á\n";
	love2[6] = "¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á\n";
	love2[7] = "¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á\n";
	love2[8] = "¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á\n";
	love2[9] = "¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡á\n";
	love2[10] = "¡á¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡á¡á\n";
	love2[11] = "¡á¡á¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡á¡á¡á\n";
	love2[12] = "¡á¡á¡á¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡á¡á¡á¡á¡á¡á\n";
	love2[13] = "¡á¡á¡á¡á¡á¡á¡á¡à¡à¡à¡à¡à¡á¡á¡á¡á¡á¡á¡á\n";
	love2[14] = "¡á¡á¡á¡á¡á¡á¡á¡á¡à¡à¡à¡á¡á¡á¡á¡á¡á¡á¡á\n";
	love2[15] = "¡á¡á¡á¡á¡á¡á¡á¡á¡á¡à¡á¡á¡á¡á¡á¡á¡á¡á¡á\n";
	love2[16] = "¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n";

	if (a == 1)
		for (i = 0; i<17; i++)
			printf("%s", love2[i]);

	else if (a == 0)
		for (i = 0; i<17; i++)
			printf("%s", love1[i]);
}